Revit 2027 API
PrimarySizeCriterion Class
 This class contains a size criterion for a RoutingPreferenceRule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingCriterionBase
 Autodesk.Revit.DB.PrimarySizeCriterion
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrimarySizeCriterion : RoutingCriterionBase
Public Class PrimarySizeCriterion
	Inherits RoutingCriterionBase
public ref class PrimarySizeCriterion : public RoutingCriterionBase
type PrimarySizeCriterion =
    class
        inherit RoutingCriterionBase
    end
The PrimarySizeCriterion type exposes the following members.
Constructors
Name | Description
PrimarySizeCriterion |  Constructs a PrimarySizeCriterion with a minimum and maximum size.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RoutingCriterionBase)
MaximumSize |  The maximum size of this criterion.
MinimumSize |  The minimum size of this criterion.
Top
Methods
Name | Description
All |  Creates a criterion with a range of all sizes.
Dispose
(Inherited from RoutingCriterionBase)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Verify if two criteria are the same.
(Inherited from RoutingCriterionBase)
None |  Creates a criterion with a range of no sizes.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace